app/controllers/school_classes_controller.rb

SELECT "school_classes".* FROM "school_classes"
---
  def index
    @classes= SchoolClass.all

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "NewSchoolAAAA"], ["room_number", 4], ["created_at", "2020-02-25 23:01:18.769640"], ["updated_at", "2020-02-25 23:01:18.769640"]]
---
  def create
    @schoolclass = SchoolClass.create(schoolclass_params)

UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "New Bronx"], ["updated_at", "2020-02-25 23:02:35.450746"], ["id", 1]]
---
  def update
    # @schoolclas = SchoolClass.find(params[:id])
    @schoolclass.update(schoolclass_params)

DELETE FROM "school_classes" WHERE "school_classes"."id" = ?  [["id", 1]]
---
  def destroy
    # @schoolclas = SchoolClass.find(params[:id])
    @schoolclass.destroy

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def find_schoolclass
    @schoolclass = SchoolClass.find(params[:id])