app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Sekou"], ["last_name", "Dosso"], ["created_at", "2020-02-25 22:11:07.106445"], ["updated_at", "2020-02-25 22:11:07.106445"]]
---
  def create
    @student = Student.create(student_params)

DELETE FROM "students" WHERE "students"."id" = ?  [["id", 3]]
---
  def destroy
    # @student = Student.find(params[:id])
    @student.destroy

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def find_student
    @student = Student.find(params[:id])